app/controllers/bears_controller.rb

SELECT "bears".* FROM "bears"
---
  def index
    @bears = Bear.all

INSERT INTO "bears" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Teddy bear"], ["description", "fluffy"], ["created_at", "2016-02-01 16:36:18.450263"], ["updated_at", "2016-02-01 16:36:18.450263"]]
---
  def create
    @bear = Bear.new(whitelisted_params)
    if @bear.save

SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @bear = Bear.find(params[:id])

SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @bear = Bear.find(params[:id])

SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "bears" SET "name" = ?, "updated_at" = ? WHERE "bears"."id" = ?  [["name", "Teddy Bear"], ["updated_at", "2016-02-01 16:39:19.206448"], ["id", 2]]
---
  def update
    @bear = Bear.find(params[:id])
    if @bear.update(whitelisted_params)

SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "bears" WHERE "bears"."id" = ?  [["id", 1]]
---
  def destroy
    @bear = Bear.find(params[:id])
    if @bear.destroy